In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [3]:
df = DataFrame({'k1':['X','X','Y','Y','Z'],
               'k2':['alpha','beta','alpha','beta','alpha'],
               'dataset1':np.random.randn(5),
               'dataset2':np.random.randn(5)})

In [4]:
df

   dataset1  dataset2 k1     k2
0  1.561883  1.081450  X  alpha
1 -0.130159  0.547466  X   beta
2  1.335514  2.045274  Y  alpha
3  0.461200 -0.149742  Y   beta
4  0.885955 -1.788903  Z  alpha

In [5]:
group1 = df['dataset1'].groupby(df['k1'])
group1

In [6]:
group1.mean()

k1
X    0.715862
Y    0.898357
Z    0.885955
Name: dataset1, dtype: float64

In [7]:
kota = np.array(['SBY','MLG','MLG','SBY','SBY'])
bulan = np.array(['JAN','FEB','JAN','FEB','JAN'])

In [8]:
df['dataset1'].groupby([kota,bulan]).mean()

MLG  FEB   -0.130159
     JAN    1.335514
SBY  FEB    0.461200
     JAN    1.223919
Name: dataset1, dtype: float64

In [9]:
df

   dataset1  dataset2 k1     k2
0  1.561883  1.081450  X  alpha
1 -0.130159  0.547466  X   beta
2  1.335514  2.045274  Y  alpha
3  0.461200 -0.149742  Y   beta
4  0.885955 -1.788903  Z  alpha

In [10]:
df.groupby('k1').mean()

    dataset1  dataset2
k1
X   0.715862  0.814458
Y   0.898357  0.947766
Z   0.885955 -1.788903

In [11]:
df.groupby(['k1','k2']).mean()

          dataset1  dataset2
k1 k2
X  alpha  1.561883  1.081450
   beta  -0.130159  0.547466
Y  alpha  1.335514  2.045274
   beta   0.461200 -0.149742
Z  alpha  0.885955 -1.788903

In [12]:
df

   dataset1  dataset2 k1     k2
0  1.561883  1.081450  X  alpha
1 -0.130159  0.547466  X   beta
2  1.335514  2.045274  Y  alpha
3  0.461200 -0.149742  Y   beta
4  0.885955 -1.788903  Z  alpha

In [13]:
df.groupby(['k1']).size()

k1
X    2
Y    2
Z    1
dtype: int64

In [14]:
for name,group in df.groupby('k1'):
    print "This is %s group" %name
    print group
    print '\n'

This is X group
   dataset1  dataset2 k1     k2
0  1.561883  1.081450  X  alpha
1 -0.130159  0.547466  X   beta


This is Y group
   dataset1  dataset2 k1     k2
2  1.335514  2.045274  Y  alpha
3  0.461200 -0.149742  Y   beta


This is Z group
   dataset1  dataset2 k1     k2
4  0.885955 -1.788903  Z  alpha

In [15]:
for (k1,k2),group in df.groupby(['k1','k2']):
    print "Key1 = %s Key2 %s" %(k1,k2)
    print group
    print '\n'

Key1 = X Key2 alpha
   dataset1  dataset2 k1     k2
0  1.561883   1.08145  X  alpha


Key1 = X Key2 beta
   dataset1  dataset2 k1    k2
1 -0.130159  0.547466  X  beta


Key1 = Y Key2 alpha
   dataset1  dataset2 k1     k2
2  1.335514  2.045274  Y  alpha


Key1 = Y Key2 beta
   dataset1  dataset2 k1    k2
3    0.4612 -0.149742  Y  beta


Key1 = Z Key2 alpha
   dataset1  dataset2 k1     k2
4  0.885955 -1.788903  Z  alpha

In [16]:
group_dict = dict(list(df.groupby('k1')))

In [17]:
group_dict['X']

   dataset1  dataset2 k1     k2
0  1.561883  1.081450  X  alpha
1 -0.130159  0.547466  X   beta

In [18]:
df

   dataset1  dataset2 k1     k2
0  1.561883  1.081450  X  alpha
1 -0.130159  0.547466  X   beta
2  1.335514  2.045274  Y  alpha
3  0.461200 -0.149742  Y   beta
4  0.885955 -1.788903  Z  alpha

In [19]:
group_dict_axis1 =dict(list(df.groupby(df.dtypes,axis=1)))

In [20]:
group_dict_axis1

{dtype('float64'):    dataset1  dataset2
 0  1.561883  1.081450
 1 -0.130159  0.547466
 2  1.335514  2.045274
 3  0.461200 -0.149742
 4  0.885955 -1.788903, dtype('O'):   k1     k2
 0  X  alpha
 1  X   beta
 2  Y  alpha
 3  Y   beta
 4  Z  alpha}

In [21]:
df

   dataset1  dataset2 k1     k2
0  1.561883  1.081450  X  alpha
1 -0.130159  0.547466  X   beta
2  1.335514  2.045274  Y  alpha
3  0.461200 -0.149742  Y   beta
4  0.885955 -1.788903  Z  alpha

In [22]:
dataset2_group = df.groupby(['k1','k2'])[['dataset2']]
dataset2_group.mean()

          dataset2
k1 k2
X  alpha  1.081450
   beta   0.547466
Y  alpha  2.045274
   beta  -0.149742
Z  alpha -1.788903